#### Set Connection

In [2]:
%load_ext sql

In [1]:
#%sql ibm_db_sa://my-username:my-password@hostname:port/BLUDB?security=SSL

#### Retrieving Data

In [8]:
%%sql
select * from customer limit 10;

 * ibm_db_sa://wqb62461:***@54a2f15b-5c0f-46df-8954-7e38e612c2bd.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32733/bludb
Done.

[(1, 'Maria', 'Anders', 'Berlin', 'Germany', '030-0074321', 31),
 (2, 'UvuvwevwevweOnyetenvewveUgwemubwemOssas', 'Trujillo', 'México D.F.', 'Mexico', '(5) 555-4729', 26),
 (3, 'Antonio', 'Moreno', 'México D.F.', 'Mexico', '(5) 555-3932', 28),
 (4, 'Thomas', 'Hardy', 'London', 'UK', '(171) 555-7788', 30),
 (5, 'Christina', 'Berglund', 'Luleå', 'Sweden', '0921-12 34 65', None),
 (6, 'Hanna', 'Moos', 'Mannheim', 'Germany', '0621-08460', 35),
 (7, 'Frédérique', 'Citeaux', 'Strasbourg', 'France', '88.60.15.31', 31),
 (8, 'Martín', 'Sommer', 'Madrid', 'Spain', '(91) 555 22 82', 28),
 (9, 'Laurence', 'Lebihan', 'Marseille', 'France', None, 18),
 (10, 'Elizabeth', 'Lincoln', 'Tsawassen', 'Canada', '(604) 555-4729', 26)]

In [15]:
#variable in SQL
age = 35
%sql select id, firstname, age from customer where age=:age;

 * ibm_db_sa://wqb62461:***@54a2f15b-5c0f-46df-8954-7e38e612c2bd.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32733/bludb
Done.

[(6, 'Hanna', 35),
 (27, 'Paolo', 35),
 (35, 'Carlos', 35),
 (40, 'Daniel', 35),
 (49, 'Giovanni', 35),
 (69, 'Alejandra', 35),
 (75, 'Art', 35),
 (76, 'Suratmi', 35),
 (85, 'Paul', 35)]

In [14]:
# asign variable
old_35 = %sql select id, firstname, age from customer where age=:age;

 * ibm_db_sa://wqb62461:***@54a2f15b-5c0f-46df-8954-7e38e612c2bd.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32733/bludb
Done.

### Save to Database

In [16]:
# convert to dataframe
import pandas as pd
old_35 = old_35.DataFrame()

In [17]:
old_35

   id  firstname  age
0   6      Hanna   35
1  27      Paolo   35
2  35     Carlos   35
3  40     Daniel   35
4  49   Giovanni   35
5  69  Alejandra   35
6  75        Art   35
7  76    Suratmi   35
8  85       Paul   35

In [18]:
# create & replace table
%sql --persist old_35

 * ibm_db_sa://wqb62461:***@54a2f15b-5c0f-46df-8954-7e38e612c2bd.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32733/bludb

'Persisted old_35'

In [19]:
%sql select * from old_35

 * ibm_db_sa://wqb62461:***@54a2f15b-5c0f-46df-8954-7e38e612c2bd.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32733/bludb
Done.

[(0, 6, 'Hanna', 35),
 (1, 27, 'Paolo', 35),
 (2, 35, 'Carlos', 35),
 (3, 40, 'Daniel', 35),
 (4, 49, 'Giovanni', 35),
 (5, 69, 'Alejandra', 35),
 (6, 75, 'Art', 35),
 (7, 76, 'Suratmi', 35),
 (8, 85, 'Paul', 35)]

In [20]:
# append to table
%sql --append old_35

 * ibm_db_sa://wqb62461:***@54a2f15b-5c0f-46df-8954-7e38e612c2bd.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32733/bludb

'Persisted old_35'

In [21]:
%sql select * from old_35

 * ibm_db_sa://wqb62461:***@54a2f15b-5c0f-46df-8954-7e38e612c2bd.c1ogj3sd0tgtu0lqde00.databases.appdomain.cloud:32733/bludb
Done.

[(0, 6, 'Hanna', 35),
 (1, 27, 'Paolo', 35),
 (2, 35, 'Carlos', 35),
 (3, 40, 'Daniel', 35),
 (4, 49, 'Giovanni', 35),
 (5, 69, 'Alejandra', 35),
 (6, 75, 'Art', 35),
 (7, 76, 'Suratmi', 35),
 (8, 85, 'Paul', 35),
 (0, 6, 'Hanna', 35),
 (1, 27, 'Paolo', 35),
 (2, 35, 'Carlos', 35),
 (3, 40, 'Daniel', 35),
 (4, 49, 'Giovanni', 35),
 (5, 69, 'Alejandra', 35),
 (6, 75, 'Art', 35),
 (7, 76, 'Suratmi', 35),
 (8, 85, 'Paul', 35)]